src/Documents/Инкассация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Инкассация</Name>
			<Comment>Инкассация</Comment>
			<BasedOn>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.КассыККМ</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФР</Name>
					<Comment>ФР на котором был пробит чек</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Comment>Касса ККМ в которой проводят изъятие/внесение денег</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧека</Name>
					<Comment>Номер чека ФР в пределах смены</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФР</Name>
					<Comment>Дата чека, пробитого на ФР</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Comment>Сквозной номер чека ФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСмены</Name>
					<Comment>Номер смены ФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Comment>Инкассатор, получающий деньги</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетовИнкассатор</Name>
					<Comment>Договор, по которому ведутся взаиморасчеты с инкассатором</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежнаяСистема</Name>
					<Comment>Платежная система по безналичным платежам</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетовПлатежнаяСистема</Name>
					<Comment>Договор, по которому ведутся взаиморасчеты с платежной системой</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
					<Comment>Оплаты</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Comment>Тип оплаты</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыОплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма без скидки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозврат</Name>
							<Comment>Сумма возврата без скидки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ВзаиморасчетыКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыКомпании</Name>
			<Comment>Блок учета взаиморасчетов с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма долга в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма долга в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБаз</Name>
					<Comment>Содержит сумму в базовой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции взаиморасчетов (оплата, предоплата...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, с которым мы ведем взаиморасчеты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>Документ отгрузки/поставки/оплаты, по которому образовался долг</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОплат</Name>
			<Comment>Типы оплаты в рознице</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
					<Comment>Оплата наличными</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
					<Comment>Оплата платежными картами</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Оплата в кредит</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлубнаяКарта</Name>
					<Comment>Оплата клубной картой</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
					<Comment>Оплата талоном/купоном</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетЗаведения</Name>
					<Comment>Оплата за счет заведения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Инкассация/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Модуль основной формы документа "Инкассация"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит обновление индикатора КассаККМОстаток
//
&НаСервере
Процедура ОбновитьИндикациюОстаткаДСВКассе()
	
	Если ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		
		ТаблицаОстатковКассы = документы.Инкассация.ПолучитьОстатокПоКассеККМ(Объект.КассаККМ,?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка.МоментВремени(), КонецДня(Объект.Дата)));  
		
		текстЗаголовок = "";
		Для Каждого СтрокаОстаткиККМ Из ТаблицаОстатковКассы Цикл
			Если СтрокаОстаткиККМ.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.Наличные Тогда
				текстЗаголовок = текстЗаголовок + СтрокаОстаткиККМ.ТипОплаты + " : "+ Формат(СтрокаОстаткиККМ.Сумма,			"ЧЦ=15; ЧДЦ=2; ЧРГ=' '; ЧН=0.00") +" "+ СокрЛП(Объект.ВалютаДокумента.Наименование) + "; ";
			Иначе
				текстЗаголовок = текстЗаголовок + СтрокаОстаткиККМ.ТипОплаты + " : "+ Формат(СтрокаОстаткиККМ.Сумма,			"ЧЦ=15; ЧДЦ=2; ЧРГ=' '; ЧН=0.00") +" "+ СокрЛП(Объект.ВалютаДокумента.Наименование) + "; ";
				текстЗаголовок = текстЗаголовок + СтрокаОстаткиККМ.ТипОплаты + " возвр.: "+Формат(СтрокаОстаткиККМ.СуммаВозврат,	"ЧЦ=15; ЧДЦ=2; ЧРГ=' '; ЧН=0.00") +" "+ СокрЛП(Объект.ВалютаДокумента.Наименование) + "; ";
			КонецЕсли;
		КонецЦикла;
		Элементы.КассаККМ.РасширеннаяПодсказка.Заголовок = текстЗаголовок;
	Иначе
		Элементы.КассаККМ.РасширеннаяПодсказка.Заголовок= НСтр("ru = '<Касса ККМ не выбрана>'");
	КонецЕсли; 

КонецПроцедуры //ОбновитьИндикациюОстаткаДСВКассе()

&НаСервере
// Выводит заголовок взаиморасчетов
//
Процедура ВывестиЗаголовокВзаиморасчеты() Экспорт
	
	Если ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетовИнкассатор) Тогда
		МоментВремени = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка.МоментВремени(), КонецДня(Объект.Дата));
		СтруктураОтбора	= Новый Структура("Контрагент,ДоговорВзаиморасчетов",Объект.Инкассатор,Объект.ДоговорВзаиморасчетовИнкассатор);
		Долг = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(МоментВремени,СтруктураОтбора,,"Сумма").Итог("Сумма");
		// Выведем на экран долг.
		Элементы.ДоговорВзаиморасчетовИнкассатор.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'По договору долг контрагента составляет:'") 
																					+ Символы.НПП + Формат(Долг,"ЧЦ=10; ЧДЦ=2; ЧН=0,00") + " "
																					+ СокрЛП(Объект.ДоговорВзаиморасчетовИнкассатор.ВалютаВзаиморасчетов.Наименование);
	Иначе
		Элементы.ДоговорВзаиморасчетовИнкассатор.РасширеннаяПодсказка.Заголовок = НСтр("ru = '<Договор не выбран>'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетовПлатежнаяСистема) Тогда
		МоментВремени = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка.МоментВремени(), КонецДня(Объект.Дата));
		СтруктураОтбора	= Новый Структура("Контрагент,ДоговорВзаиморасчетов",Объект.ПлатежнаяСистема,Объект.ДоговорВзаиморасчетовПлатежнаяСистема);
		Долг = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(МоментВремени,СтруктураОтбора,,"Сумма").Итог("Сумма");
		// Выведем на экран долг.
		Элементы.ДоговорВзаиморасчетовПлатежнаяСистема.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'По договору долг контрагента составляет:'")
																						+ Символы.НПП + Формат(Долг,"ЧЦ=10; ЧДЦ=2; ЧН=0,00")+ " "
																						+ СокрЛП(Объект.ДоговорВзаиморасчетовПлатежнаяСистема.ВалютаВзаиморасчетов.Наименование);
	Иначе
		Элементы.ДоговорВзаиморасчетовПлатежнаяСистема.РасширеннаяПодсказка.Заголовок = НСтр("ru = '<Договор не выбран>'");
	КонецЕсли;
	
КонецПроцедуры //ВывестиЗаголовокВзаиморасчеты()

// Функция для получения варианта настройки отчета ДенежныеСредстваВКассахККМ
//
&НаСервере
Функция ПолучитьНастройкуОтчета()
	
	Отчет = Отчеты.ДенежныеСредстваВКассахККМ.Создать();
	ВариантОтчета = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.Остатки.Настройки;
	
	Показатели      = ВариантОтчета.Выбор;
	СтруктураОтчета = ВариантОтчета.Структура;
	ОтборОтчета = ВариантОтчета.Отбор;
	СтруктураОтчета.Очистить();
	
	Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
		Если ТипЗнч(ТекПоказатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ТекПоказатель.Использование = Истина;
			Для Каждого ТекВложенныйПоказатель Из ТекПоказатель.Элементы Цикл
				ТекВложенныйПоказатель.Использование = Истина;
			КонецЦикла;
		ИначеЕсли НЕ ТипЗнч(ТекПоказатель) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			ТекПоказатель.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// фильтры
	КоличествоПодчиненных = ОтборОтчета.Элементы.Количество()-1;
	Пока КоличествоПодчиненных >= 0 Цикл
		Если НЕ ОтборОтчета.Элементы[КоличествоПодчиненных].ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КассаККМ") Тогда
			ОтборОтчета.Элементы.Удалить(ОтборОтчета.Элементы[КоличествоПодчиненных]);
		КонецЕсли;
			КоличествоПодчиненных = КоличествоПодчиненных - 1;
	КонецЦикла;
	
	ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	// добавляем измерения строки
	ГруппировкаСкладКомпании = ОтчетыПлатформаСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "СпособОплаты");
	
	Возврат ВариантОтчета;
	
КонецФункции // ПолучитьВариантОтчета()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатВыполнения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  Параметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ПробитьЧекЗавершениеФР(РезультатВыполнения, Параметры) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("ТипИнкассации",?(Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВнесениеВКассуККМ"),1,0));
	ПараметрыОперации.Вставить("Сумма",Объект.СуммаДокумента);
	ПараметрыОперации.Вставить("ДокументОснование" , Объект.Ссылка);
	Параметры.Вставить("ПараметрыВыбранногоЭТ", РезультатВыполнения);

	Оповещение = Новый ОписаниеОповещения("НапечататьЧекКлиентИнкассацияЗавершение", ЭтотОбъект, Параметры);
	МенеджерОборудованияКлиент.НачатьИнкассациюНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ПараметрыОперации,Объект.ФР); 
	
КонецПроцедуры //ПробитьЧекЗавершениеФР()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатВыполнения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ПараметрыОперации - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура НапечататьЧекКлиентИнкассацияЗавершение(РезультатВыполнения, ПараметрыОперации) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'При операции внесения/выемки произошла ошибка.
		|Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		
		// Получим номер чека и номер смены.
		ВыходныеПараметры = РезультатВыполнения.ВыходныеПараметры;
		Объект.НомерСмены =ВыходныеПараметры[0];
		Объект.НомерЧека =ВыходныеПараметры[1];
		Если ВыходныеПараметры.Количество() > 2 Тогда
			Объект.НомерДокумента = ВыходныеПараметры[2];
		КонецЕсли;
		
		Если (ВыходныеПараметры.Количество() > 3) И (ТипЗнч(ВыходныеПараметры[3]) = Тип("Дата")) Тогда
			Объект.ДатаФР = ВыходныеПараметры[3];
		Иначе
			Объект.ДатаФР = МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса();
		КонецЕсли;
		
		Если НЕ УправлениеДиалогомВызовСервера.ЗаписатьОбъект(Объект, ИСТИНА) Тогда
			ВывестиСообщение(НСтр("ru='Не удалось записать сведения о фискальных реквизитах в документ %1. Необходимо вручную внести данные в документ: номер чека - %2, дата чека - %3, номер смены - %4, номер документа - %5'"), Объект, "НомерЧека",,, Объект.Ссылка, Объект.НомерЧека, Объект.ДатаФР, Объект.НомерСмены, Объект.НомерДокумента);
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Операция выполнена успешно.'");
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
		
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Если Объект.ХозОперация=Справочники.ХозОперации.ВнесениеВКассуККМ Тогда
		Элементы.ПлатежнаяСистема.Доступность                      = Ложь;
		Элементы.ДоговорВзаиморасчетовПлатежнаяСистема.Доступность = Ложь;
	ИначеЕсли Объект.ХозОперация=Справочники.ХозОперации.ИзъятиеИзКассыККМ Тогда
		Элементы.ПлатежнаяСистема.Доступность                      = Истина;
		Элементы.ДоговорВзаиморасчетовПлатежнаяСистема.Доступность = Истина;
	КонецЕсли;
	
	Элементы.ФормаПробитьЧек.Доступность = НЕ ЗначениеЗаполнено(Объект.ДатаФР) И НЕ ТолькоПросмотр;
	
	ОбновитьИндикациюОстаткаДСВКассе();
	
	ВывестиЗаголовокВзаиморасчеты();
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	Пробит = ЗначениеЗаполнено(Объект.ДатаФР);
	СписокРеквизитов.Добавить("ЭтотОбъект","ЭтотОбъект",Пробит);
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события кнопки "ПробитьЧек"
//
&НаКлиенте
Процедура ПробитьЧек(Команда)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("ОповещениеПробитьЧекЗавершениеФР",Новый ОписаниеОповещения("ПробитьЧекЗавершениеФР", ЭтотОбъект,ПараметрыДействия));

	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ПробитьЧек(ЭтотОбъект,ПараметрыДействия);		
	
КонецПроцедуры //ПробитьЧек()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инкассация.ДатаПриИзменении(Объект, ПараметрыДействия);
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инкассация.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Касса ККМ" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура КассаККМПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инкассация.КассаККМПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // КассаККМПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Касса ККМ".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	КассаККМПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // КассаККМПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Инкассатор" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ИнкассаторПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инкассация.ИнкассаторПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ИнкассаторПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Инкассатор".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ИнкассаторПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ИнкассаторПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // ИнкассаторПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Договор взаиморасчетов (инкассатор)" в
// контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДоговорВзаиморасчетовИнкассаторПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инкассация.ДоговорВзаиморасчетовИнкассаторПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДоговорВзаиморасчетовИнкассаторПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Договор взаиморасчетов (инкассатор)".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДоговорВзаиморасчетовИнкассаторПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДоговорВзаиморасчетовИнкассаторПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры  // ДоговорВзаиморасчетовИнкассаторПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Платежная система" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ПлатежнаяСистемаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инкассация.ПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПлатежнаяСистемаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Платежная система".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПлатежнаяСистемаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ПлатежнаяСистемаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // ПлатежнаяСистемаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Договор взаиморасчетов (Платежная
// система)" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДоговорВзаиморасчетовПлатежнаяСистемаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инкассация.ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДоговорВзаиморасчетовПлатежнаяСистемаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Договор взаиморасчетов(Платежная система)".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДоговорВзаиморасчетовПлатежнаяСистемаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ОПЛАТЫ"

&НаСервере
Процедура ОплатыПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Обновляем заголовок надписи итоговой суммы по документу
	ЗащищенныеФункцииСервер.УстановитьЗаголовокНадписиСуммаДокумента(ЭтотОбъект);
	
	Объект.СуммаДокумента = Объект.Оплаты.Итог("Сумма");
	Если Элементы.Оплаты.ТекущаяСтрока <> Неопределено Тогда
		ТекущиеДанные = Объект.Оплаты.НайтиПоИдентификатору(Элементы.Оплаты.ТекущаяСтрока);
		Если ТекущиеДанные.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.Наличные И ТекущиеДанные.СуммаВозврат <> 0 Тогда
			ТекстСообщения = НСтр("ru = 'Для наличной оплаты невозможно изъять сумму возврата'");
			ВывестиСообщение(ТекстСообщения, Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ОплатыПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОплатыПослеУдаленияНаСервере(ПараметрыДействия = Неопределено)
	
	// Обновляем заголовок надписи итоговой суммы по документу
	ЗащищенныеФункцииСервер.УстановитьЗаголовокНадписиСуммаДокумента(ЭтотОбъект);
	
КонецПроцедуры // ОплатыПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ОплатыПослеУдаления(Элемент)
	
	// Обработаем событие в контексте сервера
	ОплатыПослеУдаленияНаСервере();
	
КонецПроцедуры // ОплатыПослеУдаления()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура ОплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования, "Оплаты");
	
КонецПроцедуры // ОплатыПриОкончанииРедактирования()

//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОплатыТипОплатыПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Оплаты.НайтиПоИдентификатору(Элементы.Оплаты.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инкассация.ОплатыТипОплатыПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
КонецПроцедуры

&НаКлиенте
Процедура ОплатыТипОплатыПриИзменении(Элемент)
	ОплатыТипОплатыПриИзмененииНаСервере();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Сумма документа".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьСуммаДокументаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.ПоказатьРасширенныеИтогиОперации(ЭтотОбъект, Элемент);
	
КонецПроцедуры // НадписьСуммаДокументаНажатие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Взаиморасчеты".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьВзаиморасчетыИнкассаторНажатие(Элемент)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.НадписьВзаиморасчетыНажатие(ЭтотОбъект, "Инкассатор", "ДоговорВзаиморасчетовИнкассатор");
	
КонецПроцедуры // НадписьВзаиморасчетыИнкассаторНажатие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Взаиморасчеты".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьВзаиморасчетыПСНажатие(Элемент)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.НадписьВзаиморасчетыНажатие(ЭтотОбъект, "ПлатежнаяСистема", "ДоговорВзаиморасчетовПлатежнаяСистема");
	
КонецПроцедуры // НадписьВзаиморасчетыПСНажатие()

// Обработчик события возникающего на клиенте при нажатии на надпись "НадписьКассаККМОстаток".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьКассаККМОстатокНажатие(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		Возврат;
	КонецЕсли;
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	
	ОтчетОтбор.Вставить("КассаККМ", Объект.КассаККМ);
	
	НастройкиВарианта = ПолучитьНастройкуОтчета();
	
	ОтчетыПлатформаКлиент.ОткрытьОтчет("Отчет.ДенежныеСредстваВКассахККМ", "Остатки", НастройкиВарианта,,, ОтчетОтбор, , ОбщегоНазначенияКлиент.ДатаСеанса());
	
КонецПроцедуры // НадписьКассаККМОстатокНажатие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
		
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	 	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
